src/cf/DataProcessors/ОбменRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменRMQ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭкземплярRMQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭкземплярыRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьRMQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОчередиRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ОбменRMQ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПроверитьПодключение(Команда) 
	
	ПроверитьПодключениеСервер();
	
КонецПроцедуры       

Процедура ПроверитьПодключениеСервер()  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Адрес);
	СтруктураПараметров.Вставить("Порт", Порт);
	СтруктураПараметров.Вставить("Логин", Логин);
	СтруктураПараметров.Вставить("Пароль", Пароль);
	СтруктураПараметров.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	Обработки.ОбменRMQ.ПроверитьПодключение(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкземплярRMQПриИзменении(Элемент)
	  
	ЭкземплярПриИзмененииНаСервере();
	
КонецПроцедуры                       

Процедура ЭкземплярПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ЭкземплярRMQ) Тогда
		Возврат;
	КонецЕсли;          
	
	ОбработкаОбменRMQ = РеквизитФормыВЗначение("Объект");
	
	СсылкаНаЭкземплярRMQ = ОбработкаОбменRMQ.ЭкземплярRMQ;
	Адрес = СсылкаНаЭкземплярRMQ.ИмяСервера; 
	Порт = СсылкаНаЭкземплярRMQ.Порт;
	Логин = СсылкаНаЭкземплярRMQ.Имя;
	Пароль = СсылкаНаЭкземплярRMQ.Пароль;
	ВиртуальныйХост = СсылкаНаЭкземплярRMQ.ВиртуальныйХост; 
	
	СсылкаНаОчередьRMQ = ОбработкаОбменRMQ.ОчередьRMQ;
    Очередь = СсылкаНаОчередьRMQ.Очередь;
	ТочкаОбмена = СсылкаНаОчередьRMQ.ТочкаОбмена.Наименование;
	КлючМаршрутизации = СсылкаНаОчередьRMQ.КлючМаршрутизации;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщенияНаСервере()  
	
	Если Адрес = "" Тогда
		Сообщить("Не выбрано подключение. Отправка прервана.");
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Адрес);
	СтруктураПараметров.Вставить("Порт", Порт);
	СтруктураПараметров.Вставить("Логин", Логин);
	СтруктураПараметров.Вставить("Пароль", Пароль);
	СтруктураПараметров.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	
	СтруктураПараметров.Вставить("ТочкаОбмена", ТочкаОбмена);
	СтруктураПараметров.Вставить("ИмяОчереди", Очередь);
	СтруктураПараметров.Вставить("КлючМаршрутизации", КлючМаршрутизации); 
	  
	//ТаблицаСообщений = ТаблицаОчередь.Выгрузить();
	ТаблицаСообщений = ОбслуживаниеСообщенийRMQ.ПолучитьОчередьСообщенийRMQ();
	Обработки.ОбменRMQ.ОтправитьСообщения(СтруктураПараметров, ТаблицаСообщений); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщения(Команда)  
	
	Если ТаблицаОчередь.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отправлять нечего!";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;  
	
	ОтправитьСообщенияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОчередьRMQПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ОчередьRMQ) Тогда
		Возврат;
	КонецЕсли;          
	
	ОбработкаОбменRMQ = РеквизитФормыВЗначение("Объект");
		
	СсылкаНаОчередьRMQ = ОбработкаОбменRMQ.ОчередьRMQ;
    Очередь = СсылкаНаОчередьRMQ.Очередь;
	ТочкаОбмена = СсылкаНаОчередьRMQ.ТочкаОбмена.Наименование;
	КлючМаршрутизации = СсылкаНаОчередьRMQ.КлючМаршрутизации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчередьRMQПриИзменении(Элемент) 
	
	ОчередьRMQПриИзмененииНаСервере();  
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуОчередьНаСервере()
		
	ТаблицаОчередь.Загрузить(ОбслуживаниеСообщенийRMQ.ПолучитьОчередьСообщенийRMQ());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуОчередь(Команда) 
	
	ОбновитьТаблицуОчередьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОчередьПриАктивизацииСтроки(Элемент) 

	ТекущиеДанные = Элементы.ТаблицаОчередь.ТекущиеДанные; 
	Если ТекущиеДанные <> Неопределено Тогда
		ТекстСообщенияВТекущейСтроке = ПолучитьТекстСообщенияНаСервере(ТекущиеДанные.ХранилищеСообщения);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ПолучитьТекстСообщенияНаСервере(ХранилищеСообщения)     
		
	ТекстСообщения = ХранилищеСообщения.Получить();  
	
	Возврат ТекстСообщения;
		
КонецФункции

&НаКлиенте
Процедура ПолучитьСообщения(Команда)

	Если Объект.ЭкземплярRMQ.Пустая() или Объект.ОчередьRMQ.Пустая() Тогда
		Сообщить("Заполните настройки на вкладке ""Настройки"". Получение сообщений отменено.");
		Возврат;
	КонецЕсли;
	
	ПолучитьСообщенияНаСервере();
	
КонецПроцедуры 

Процедура ПолучитьСообщенияНаСервере()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", Адрес);
	СтруктураПараметров.Вставить("Порт", Порт);
	СтруктураПараметров.Вставить("Логин", Логин);
	СтруктураПараметров.Вставить("Пароль", Пароль);
	СтруктураПараметров.Вставить("ВиртуальныйХост", ВиртуальныйХост);
	
	СтруктураПараметров.Вставить("ТочкаОбмена", ТочкаОбмена);
	СтруктураПараметров.Вставить("ИмяОчереди", Очередь);
	СтруктураПараметров.Вставить("КлючМаршрутизации", КлючМаршрутизации);
	   
	ТаблицаПолученныхСообщений = ТаблицаОчередьНаПолучение.Выгрузить();
	Обработки.ОбменRMQ.ПолучитьСообщения(СтруктураПараметров, ТаблицаПолученныхСообщений);
	ТаблицаОчередьНаПолучение.Загрузить(ТаблицаПолученныхСообщений);    
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОбъектыНаСервере()   
	
	Для Каждого Строка Из ТаблицаОчередьНаПолучение Цикл  
		
		Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);   
		Чтение = Новый ЧтениеJSON; 
		Чтение.УстановитьСтроку(Строка.Сообщение);
		НовыйОбъект = Сериализатор.ПрочитатьJSON(Чтение);  
		
		ПодстрокаОбъявлениеУИД = """Ref"": ";	
		ПозицияСтрокиСИдентификатором = Найти(Строка.Сообщение, ПодстрокаОбъявлениеУИД);
		УИД = Сред(Строка.Сообщение, ПозицияСтрокиСИдентификатором + СтрДлина(ПодстрокаОбъявлениеУИД) + 1, 36); 
	    GUID = Новый УникальныйИдентификатор(УИД);
		МетаданныеПолноеИмя = НовыйОбъект.Метаданные().ПолноеИмя();
		Проводим = ложь;
		Если Найти(МетаданныеПолноеИмя, "Справочник") Тогда      
			МетаданныеЗаданногоИмени = Справочники[НовыйОбъект.Метаданные().Имя];
		ИначеЕсли Найти(МетаданныеПолноеИмя, "Документ") Тогда 
			МетаданныеЗаданногоИмени = Документы[НовыйОбъект.Метаданные().Имя]; 
			Проводим = истина;
		КонецЕсли; 
		СсылкаНаОбъект = МетаданныеЗаданногоИмени.ПолучитьСсылку(GUID);  
		ЗаписатьОбъект(GUID, НовыйОбъект, СсылкаНаОбъект,СсылкаНаОбъект.ПолучитьОбъект() = Неопределено, Проводим)		
					
	КонецЦикла;
	
КонецПроцедуры  

Процедура ЗаписатьОбъект(GUID, НовыйОбъект, СсылкаНаОбъект,ЭтоНовый, Проводим) 
	Если ЭтоНовый Тогда
		 НовыйОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);		
	КонецЕсли;

	Если Проводим Тогда
		НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Иначе	
		НовыйОбъект.Записать();
	КонецЕсли;
	
	
КонецПроцедуры 


&НаКлиенте
Процедура СоздатьОбъекты(Команда)
	СоздатьОбъектыНаСервере();
КонецПроцедуры

&НаСервере
Процедура НазначитьКлючМаршрутизацииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НазначитьКлючМаршрутизации(Команда)
	НазначитьКлючМаршрутизацииНаСервере();
КонецПроцедуры
